<?php

return [
    'name.required' => 'الاسم مطلوب',
    'name.string' => 'الاسم يجب أن يكون نص',
    'name.min' => 'الاسم يجب ألا يقل عن 3 حروف',
    'name.max' => 'الاسم يجب ألا يزيد عن 255 حرف',

    'email.required' => 'البريد الإلكتروني مطلوب',
    'email.email' => 'البريد الإلكتروني غير صالح',
    'email.unique' => 'هذا البريد الإلكتروني مستخدم بالفعل',

    'phone.required' => 'رقم الهاتف مطلوب',
    'phone.digits_between' => 'رقم الهاتف يجب أن يكون بين 10 و 14 رقم',
    'phone.unique' => 'رقم الهاتف مستخدم بالفعل',

    'password.required_ar' => 'حقل كلمة المرور مطلوب.',
    'password.string_ar' => 'يجب أن تكون كلمة المرور نصًا.',
    'password.min_ar' => 'يجب ألا تقل كلمة المرور عن 6 أحرف.',
    'password.max_ar' => 'يجب ألا تزيد كلمة المرور عن 32 حرفًا.',
    'password.confirmed' => 'تأكيد كلمة المرور غير متطابق',

    'login.required' => 'بيانات الادخال مطلوبة',
    'login.string' => 'بيانات الادخال ايميل او رقم هاتف فقط'
];
